---
kind: property
id: P:Autodesk.Revit.DB.MEPCurve.Width
zh: 宽度
source: html/978bbf62-3cba-1580-8080-61888b92b55d.htm
---
# Autodesk.Revit.DB.MEPCurve.Width Property

**中文**: 宽度

The width of the MEP curve.

## Syntax (C#)
```csharp
public double Width { get; }
```

## Remarks
This property is used to retrieve the width of the MEP curve.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the MEP curve's shape is not rectangular.